{
  "name": "hpcc-symphony-test",
  "type": [
    "terraform_v1.1"
  ],
  "location": "us-east",
  "resource_group": "Default",
  "description": "",
  "tags": ["hpcc", "symphony"],
  "template_repo": {
    "url": "https://github.com/IBM-Cloud/hpc-cluster-symphony"
  },
  "template_data": [
    {
      "folder": ".",
      "type": "terraform_v1.1",
      "env_values":[
        { 
          "TF_CLI_ARGS_apply": "-parallelism=250"
        },
        { 
          "TF_CLI_ARGS_plan": "-parallelism=250"
        },
        {
          "TF_CLI_ARGS_destroy": "-parallelism=100"
        },
        {
          "VAR1":"<val1>"
        },
        {
          "VAR2":"<val2>"
        } 
      ],
      "variablestore": [
        {
          "name": "cluster_prefix",
          "value": "hpcc-symphony-test",
          "type": "string",
          "secure": false,
          "description": "Prefix that is used to name the Spectrum Symphony cluster and IBM Cloud resources that are provisioned to build the Spectrum Symphony cluster instance. You cannot create more than one instance of the Symphony cluster with the same name. Make sure that the name is unique."
        },
        {
          "name": "cluster_id",
          "value": "HpccTest",
          "type": "string",
          "secure": false,
          "description": "Unique ID of the cluster used by Symphony for configuration of resources. This must be up to 39 alphanumeric characters including the underscore (_), the hyphen (-), and the period (.). Other special characters and spaces are not allowed. Do not use the name of any host or user as the name of your cluster. You cannot change it after installation."
        },
        {
          "name": "vpc_name",
          "value": "",
          "type": "string",
          "secure": false,
          "description": "Name of an existing VPC in which the cluster resources will be deployed. If no value is given, then a new VPC will be provisioned for the cluster. [Learn more](https://cloud.ibm.com/docs/vpc)"
        },
        {
          "name": "resource_group",
          "value": "Default",
          "type": "string",
          "secure": false,
          "description": "Resource group name from your IBM Cloud account where the VPC resources should be deployed. Note: Do not modify the \"Default\" value if you would like to use the auto-scaling capability. For additional information on resource groups, see [Managing resource groups](https://cloud.ibm.com/docs/account?topic=account-rgs)."
        },
        {
          "name": "zone",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "IBM Cloud zone name within the selected region where the Spectrum Symphony cluster should be deployed. [Learn more](https://cloud.ibm.com/docs/vpc?topic=vpc-creating-a-vpc-in-a-different-region#get-zones-using-the-cli)."
        },
        {
          "name": "image_name",
          "value": "hpcc-symp731-scale5151-rhel84-v1-4",
          "type": "string",
          "secure": false,
          "description": "Name of the custom image that you want to use to create virtual server instances in your IBM Cloud account to deploy the IBM Spectrum Symphony cluster. By default, the automation uses a base image with additional software packages mentioned [here](https://cloud.ibm.com/docs/hpc-spectrum-symphony#create-custom-image). If you would like to include your application-specific binary files, follow the instructions in [ Planning for custom images ](https://cloud.ibm.com/docs/vpc?topic=vpc-planning-custom-images) to create your own custom image and use that to build the IBM Spectrum Symphony cluster through this offering."
        },
        {
          "name": "storage_node_instance_type",
          "value": "bx2-2x8",
          "type": "string",
          "secure": false,
          "description": "Specify the virtual server instance profile type to be used to create the storage node for the Spectrum Symphony cluster. The storage node is the one that would be used to create an NFS instance to manage the data for HPC workloads. For choices on profile types, see [Instance profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "worker_node_instance_type",
          "value": "bx2-4x16",
          "type": "string",
          "secure": false,
          "description": "Specify the virtual server instance or bare metal server profile type name to be used to create the worker nodes for the Spectrum Symphony cluster based on worker_node_type. The worker nodes are the ones where the workload execution takes place and the choice should be made according to the characteristic of workloads. For more information, see [virtual server instance ](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles) and [bare metal server profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-bare-metal-servers-profile&interface=ui). NOTE: If dedicated_host_enabled == true, available instance prefix (e.g., bx2 and cx2) can be limited depending on your target region. Check `ibmcloud target -r {region_name}; ibmcloud is dedicated-host-profiles`."
        },
        {
          "name": "management_node_instance_type",
          "value": "bx2-4x16",
          "type": "string",
          "secure": false,
          "description" : "Specify the virtual server instance profile type to be used to create the management nodes for the Spectrum Symphony cluster. For choices on profile types, see [Instance profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "login_node_instance_type",
          "value": "bx2-2x8",
          "type": "string",
          "secure": false,
          "description": "Specify the virtual server instance profile type to be used to create the login node for the Spectrum Symphony cluster. For choices on profile types, see [Instance profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "management_node_count",
          "value": "3",
          "type": "number",
          "secure": false,
          "description": "Number of management nodes. This is the total number of primary, secondary and management nodes. There will be one Primary, one Secondary and the rest of the nodes will be management nodes. Enter a value in the range 1 - 10."
        },
        {
          "name": "worker_node_max_count",
          "value": "10",
          "type": "number",
          "secure": false,
          "description": "The maximum number of virtual server instance or bare metal server worker nodes that can be provisioned in the cluster. To take advantage of the auto-scale feature from [Host Factory](https://www.ibm.com/docs/en/spectrum-symphony/7.3.1?topic=factory-overview), the value needs to be greater than worker_node_min_count. If using virtual server instances, enter a value in the range 1 - 500. If using bare metal servers, the value needs to match worker_node_min_count, and the permitted value is in the range 1 - 16. Note: If you plan to use Spectrum Scale storage, the value for this parameter should be equal to worker_node_min_count."
        },
        {
          "name": "worker_node_min_count",
          "value": "0",
          "type": "number",
          "secure": false,
          "description":  "The minimum number of virtual server instance or bare metal server worker nodes that will be provisioned at the time the cluster is created. For bare metal servers, enter a value in the range 1 - 16. For virtual server instances with NFS storage, enter a value in the range 0 - 500. For virtual server instances with Spectrum Scale storage, enter a value in the range 1 - 64. Note: Spectrum Scale requires a minimum of 3 compute nodes (combination of primary, secondary, management, and worker nodes) to establish a [quorum](https://www.ibm.com/docs/en/spectrum-scale/5.1.5?topic=failure-quorum#nodequo) and maintain data consistency if a node fails. Therefore, the minimum value of 1 might need to be larger if the value specified for management_node_count is less than 2."
        },
        {
          "name": "ssh_key_name",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "Comma-separated list of names of the SSH keys that is configured in your IBM Cloud account that is used to establish a connection to the Symphony primary node. Ensure the SSH key is present in the same resource group and region where the cluster is being provisioned. If you do not have an SSH key in your IBM Cloud account, create one by using the instructions given at [SSH Keys](https://cloud.ibm.com/docs/vpc?topic=vpc-ssh-keys)."
        },
        {
          "name": "volume_capacity",
          "value": "100",
          "type": "number",
          "secure": false,
          "description": "Size in GB for the block storage that would be used to build the NFS instance and would be available as a mount on Spectrum Symphony primary node. Enter a value in the range 10 - 16000."
        },
        {
          "name": "volume_profile",
          "value": "general-purpose",
          "type": "string",
          "secure": false,
          "description": "Name of the block storage volume type to be used for NFS instance. For possible options, see[Block storage profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-block-storage-profiles)."
        },
        {
          "name": "volume_iops",
          "value": "3000",
          "type": "number",
          "secure": false,
          "description": "Number to represent the IOPS(Input Output Per Second) configuration for block storage to be used for NFS instance (valid only for volume_profile=custom, dependent on volume_capacity). Enter a value in the range 100 - 48000. For possible options of IOPS, see [Custom IOPS profile](https://cloud.ibm.com/docs/vpc?topic=vpc-block-storage-profiles#custom)."
        },
        {
          "name": "api_key",
          "value": "Please fill here",
          "type": "string",
          "secure": true,
          "description": "This is the IBM Cloud API key for IBM Cloud account where the IBM Spectrum Symphony cluster needs to be deployed. For more information on how to create an API key, see [Managing user API keys](https://cloud.ibm.com/docs/account?topic=account-userapikey)."
        },
        {
          "name": "ibm_customer_number",
          "value": "Please fill here",
          "type": "string",
          "secure": true,
          "description": "Comma-separated list of the IBM Customer Number(s) (ICN) that is used for the Bring Your Own License (BYOL) entitlement check. For more information on how to find your ICN, see [What is my IBM Customer Number (ICN)?](https://www.ibm.com/support/pages/what-my-ibm-customer-number-icn)."
        },
        {
          "name": "hyperthreading_enabled",
          "value": "true",
          "type": "bool",
          "secure": false,
          "description": "Setting this to true will enable hyper-threading in the worker nodes of the cluster(default). Otherwise, hyper-threading will be disabled."
        },
        {
          "name": "remote_allowed_ips",
          "value": "[\"Please fill here\"]",
          "type": "list(string)",
          "secure": false,
          "description": "Comma-separated list of IP addresses that can access the Spectrum Symphony instance through an SSH or RDP interface. For security purposes, provide the public IP addresses assigned to the devices that are authorized to establish SSH or RDP connections (for example, [\"169.45.117.34\"]). To fetch the IP address of the device, use [https://ipv4.icanhazip.com/](https://ipv4.icanhazip.com/)."
        },
        {
          "name": "vpn_enabled",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Set the value as true to deploy a VPN gateway for VPC in the cluster."
        },
        {
          "name": "vpn_preshared_key",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "The pre-shared key for the VPN."
        },
        {
          "name": "vpn_peer_cidrs",
          "value": "",
          "type": "string",
          "secure": false,
          "description": "Comma separated list of peer CIDRs (e.g., 192.168.0.0/24) to which the VPN will be connected."
        },
        {
          "name": "vpn_peer_address",
          "value": "",
          "type": "string",
          "secure": false,
          "description": "The peer public IP address to which the VPN will be connected."
        },
        {
          "name": "dedicated_host_enabled",
          "value": "false",
          "type": "bool",
          "description": "Set to true to use dedicated hosts for compute hosts (default: false). Note that Symphony still dynamically provisions compute hosts at public virtual server instances and dedicated hosts are used only for static compute hosts provisioned at the time the cluster is created. The number of dedicated hosts and the profile names for dedicated hosts are calculated from worker_node_min_count and worker_node_instance_type."
        },
        {
          "name": "dedicated_host_placement",
          "value": "spread",
          "type": "string",
          "description": "Specify 'pack' or 'spread'. The 'pack' option will deploy virtual server instances on one dedicated host until full before moving on to the next dedicated host. The 'spread' option will deploy virtual server instances in round-robin fashion across all the dedicated hosts. The second option should result in mostly even distribution of instances on the hosts, while the first option might result in one dedicated host being mostly empty."
        },
        {
          "name": "spectrum_scale_enabled",
          "value": "false",
          "type": "bool",
          "secure": false,
          "description": "Setting this to 'true' will enable Spectrum Scale integration with the cluster. Otherwise, Spectrum Scale integration will be disabled (default). By entering 'true' for the property you have also agreed to one of the two conditions. 1. You are using the software in production and confirm you have sufficient licenses to cover your use under the International Program License Agreement (IPLA). 2. You are evaluating the software and agree to abide by the International License Agreement for Evaluation of Programs (ILAE). NOTE: Failure to comply with licenses for production use of software is a violation of [IBM International Program License Agreement](https://www.ibm.com/software/passportadvantage/programlicense.html)."
        },
        {
          "name": "scale_storage_image_name",
          "value": "hpcc-scale5151-rhel84",
          "type": "string",
          "secure": false,
          "description": "Name of the custom image that you would like to use to create virtual machines in your IBM Cloud account to deploy the Spectrum Scale storage cluster. By default, our automation uses a base image plus the Spectrum Scale software and any other software packages that it requires. If you'd like, you can follow the instructions for [Planning for custom images](https://cloud.ibm.com/docs/vpc?topic=vpc-planning-custom-images) to create your own custom image and use that to build the Spectrum Scale storage cluster through this offering."
        },
        {
          "name": "scale_storage_node_count",
          "value": "4",
          "type": "number",
          "secure": false,
          "description": "The number of Spectrum Scale storage nodes that are provisioned at the time the cluster is created. Enter a value in the range 2 - 18. It has to be divisible by 2."
        },
        {
          "name": "scale_storage_node_instance_type",
          "value": "bx2d-32x128",
          "type": "string",
          "secure": false,
          "description": "Specify the virtual server instance storage profile type name to be used to create the Spectrum Scale storage nodes for the Spectrum Symphony cluster. For more information, see [Instance profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "scale_storage_cluster_filesystem_mountpoint",
          "value": "/gpfs/fs1",
          "type": "string",
          "secure": false,
          "description": "Spectrum Scale storage cluster (owningCluster) file system mount point. The owningCluster is the cluster that owns and serves the file system to be mounted.  For more information, see [Mounting a remote GPFS file system](https://www.ibm.com/docs/en/spectrum-scale/5.1.5?topic=system-mounting-remote-gpfs-file)."
        },
        {
          "name": "scale_filesystem_block_size",
          "value": "4M",
          "type": "string",
          "secure": false,
          "description": "File system [block size](https://www.ibm.com/docs/en/spectrum-scale/5.1.5?topic=considerations-block-size). Spectrum Scale supported block sizes (in bytes) include: 256K, 512K, 1M, 2M, 4M, 8M, 16M."
        },
        {
          "name": "scale_storage_cluster_gui_username",
          "value": "",
          "type": "string",
          "secure": false,
          "description": "GUI user to perform system management and monitoring tasks on storage cluster. Note: Username should be at least 4 characters, any combination of lowercase and uppercase letters."
        },
        {
          "name": "scale_storage_cluster_gui_password",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "Password for Spectrum Scale storage cluster GUI. Note: Password should be at least 8 characters, must have one number, one lowercase letter, one uppercase letter, and at least one unique character. Password should not contain username."
        },
        {
          "name": "scale_compute_cluster_gui_username",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "GUI user to perform system management and monitoring tasks on compute cluster. Note: Username should be at least 4 characters, any combination of lowercase and uppercase letters."
        },
        {
          "name": "scale_compute_cluster_gui_password",
          "value": "",
          "type": "string",
          "secure": true,
          "description": "Password for compute cluster GUI. Note: Password should be at least 8 characters, must have one number, one lowercase letter, one uppercase letter, and at least one unique character. Password should not contain username."
        },
        {
          "name": "scale_compute_cluster_filesystem_mountpoint",
          "value": "/gpfs/fs1",
          "type": "string",
          "secure": false,
          "description": "Compute cluster (accessingCluster) file system mount point. The accessingCluster is the cluster that accesses the owningCluster. For more information, see [Mounting a remote GPFS file system](https://www.ibm.com/docs/en/spectrum-scale/5.1.5?topic=system-mounting-remote-gpfs-file)."
        },
        {
          "name": "worker_node_type",
          "value": "vsi",
          "type": "string",
          "description": "The type of server that's used for the worker nodes: virtual server instance or bare metal server. If you choose vsi, the worker nodes are deployed on virtual server instances, or if you choose baremetal, the worker nodes are deployed on bare metal servers. Note: If baremetal is selected, only static worker nodes are supported; you will not be able to use the Spectrum Symphony Host Factory feature for auto-scaling on the cluster."
        },
        {
          "name": "TF_WAIT_DURATION",
          "value": "180s",
          "type": "string",
          "description": "wait duration time set for the storage and worker node to complete the entire setup"
        },
        {
          "name": "vpc_cidr_block",
          "value": "[\"10.241.0.0/18\"]",
          "type": "list(string)",
          "description": "Creates the address prefix for the new VPC, when the vpc_name variable is empty. Only a single address prefix is allowed. For more information, see [Setting IP ranges](https://cloud.ibm.com/docs/vpc?topic=vpc-vpc-addressing-plan-design)."
        },
        {
          "name": "vpc_cluster_private_subnets_cidr_blocks",
          "value": "[\"10.241.0.0/22\"]",
          "type": "list(string)",
          "description": "The CIDR block that's required for the creation of the compute and storage cluster private subnet. Modify the CIDR block if it has already been reserved or used for other applications within the VPC or conflicts with any on-premises CIDR blocks when using a hybrid environment. Provide only one CIDR block for the creation of the compute and storage subnet. Make sure to select a CIDR block size that will accommodate the maximum number of management, storage, and both static and dynamic worker nodes that you expect to have in your cluster.  For more information on CIDR block size selection, see [Choosing IP ranges for your VPC](https://cloud.ibm.com/docs/vpc?topic=vpc-choosing-ip-ranges-for-your-vpc)."
        },
        {
          "name": "vpc_cluster_login_private_subnets_cidr_blocks",
          "value": "[\"10.241.4.0/28\"]",
          "type": "list(string)",
          "description": "The CIDR block that's required for the creation of the login cluster private subnet. Modify the CIDR block if it has already been reserved or used for other applications within the VPC or conflicts with any on-premises CIDR blocks when using a hybrid environment. Provide only one CIDR block for the creation of the login subnet. Since login subnet is used only for the creation of login virtual server instance provide a CIDR range of /28."
        }
      ]
    }
  ]
}
